IDENTIFICATION DIVISION.
PROGRAM-ID. VALUE-READERS.

ENVIRONMENT DIVISION.
REPOSITORY.
    COPY "ICEBERG-TYPES.cbl" REPLACING ==Types== BY ==TYPES==.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NULL-READER.
    05 FILLER REDEFINES NULL-READER PIC X(1) VALUE X"00".

01 CONSTANT-READER.
    05 CONSTANT PIC X.

01 REPLACE-WITH-CONSTANT-READER.
    05 REPLACE-READER PIC X.
    05 CONSTANT PIC X.

01 BOOLEAN-READER.
    05 FILLER REDEFINES BOOLEAN-READER PIC X(1) VALUE X"01".

01 INTEGER-READER.
    05 FILLER REDEFINES INTEGER-READER PIC X(1) VALUE X"02".

01 INTEGER-AS-LONG-READER.
    05 FILLER REDEFINES INTEGER-AS-LONG-READER PIC X(1) VALUE X"03".

01 LONG-READER.
    05 FILLER REDEFINES LONG-READER PIC X(1) VALUE X"04".

01 FLOAT-READER.
    05 FILLER REDEFINES FLOAT-READER PIC X(1) VALUE X"05".

01 FLOAT-AS-DOUBLE-READER.
    05 FILLER REDEFINES FLOAT-AS-DOUBLE-READER PIC X(1) VALUE X"06".

01 DOUBLE-READER.
    05 FILLER REDEFINES DOUBLE-READER PIC X(1) VALUE X"07".

01 STRING-READER.
    05 FILLER REDEFINES STRING-READER PIC X(1) VALUE X"08".

01 UTF8-READER.
    05 FILLER REDEFINES UTF8-READER PIC X(1) VALUE X"09".

01 ENUM-READER.
    05 SYMBOL-COUNT PIC 9(4) COMP.
    05 SYMBOL-TABLE OCCURS 1 TO 9999 TIMES DEPENDING ON SYMBOL-COUNT
       PIC X(1024).

01 UUID-READER.
    05 FILLER REDEFINES UUID-READER PIC X(1) VALUE X"0A".

01 FIXED-READER.
    05 LENGTH PIC 9(4) COMP.

01 GENERIC-FIXED-READER.
    05 SCHEMA-SIZE PIC 9(4) COMP.

01 BYTES-READER.
    05 FILLER REDEFINES BYTES-READER PIC X(1) VALUE X"0B".

01 BYTE-BUFFER-READER.
    05 FILLER REDEFINES BYTE-BUFFER-READER PIC X(1) VALUE X"0C".

01 DECIMAL-READER.
    05 UNSCALED-READER PIC X.
    05 SCALE PIC 9(4) COMP.

01 UNION-READER.
    05 READER-COUNT PIC 9(4) COMP.
    05 READER-TABLE OCCURS 1 TO 9999 TIMES DEPENDING ON READER-COUNT
       PIC X.

01 ARRAY-READER.
    05 ELEMENT-READER PIC X.

01 ARRAY-MAP-READER.
    05 KEY-READER PIC X.
    05 VALUE-READER PIC X.

01 MAP-READER.
    05 KEY-READER PIC X.
    05 VALUE-READER PIC X.

01 RECORD-READER.
    05 READER-COUNT PIC 9(4) COMP.
    05 READER-TABLE OCCURS 1 TO 9999 TIMES DEPENDING ON READER-COUNT
       PIC X.
    05 SCHEMA-SIZE PIC 9(4) COMP.

01 INDEXED-RECORD-READER.
    05 READER-COUNT PIC 9(4) COMP.
    05 READER-TABLE OCCURS 1 TO 9999 TIMES DEPENDING ON READER-COUNT
       PIC X.
    05 SCHEMA-SIZE PIC 9(4) COMP.
    05 CLASS-NAME PIC X(1024).

01 PLANNED-RECORD-READER.
    05 SCHEMA-SIZE PIC 9(4) COMP.
    05 PLAN-COUNT PIC 9(4) COMP.
    05 PLAN-TABLE OCCURS 1 TO 9999 TIMES DEPENDING ON PLAN-COUNT.
       10 POSITION PIC 9(4) COMP.
       10 READER PIC X.

01 PLANNED-INDEXED-READER.
    05 SCHEMA-SIZE PIC 9(4) COMP.
    05 PLAN-COUNT PIC 9(4) COMP.
    05 PLAN-TABLE OCCURS 1 TO 9999 TIMES DEPENDING ON PLAN-COUNT.
       10 POSITION PIC 9(4) COMP.
       10 READER PIC X.
    05 CLASS-NAME PIC X(1024).

01 SKIP-STRUCT-READER.
    05 READER-COUNT PIC 9(4) COMP.
    05 READER-TABLE OCCURS 1 TO 9999 TIMES DEPENDING ON READER-COUNT
       PIC X.

01 POSITION-READER.
    05 FILLER REDEFINES POSITION-READER PIC X(1) VALUE X"0D".

PROCEDURE DIVISION.
    INITIALIZE NULL-READER.
    INITIALIZE CONSTANT-READER.
    INITIALIZE REPLACE-WITH-CONSTANT-READER.
    INITIALIZE BOOLEAN-READER.
    INITIALIZE INTEGER-READER.
    INITIALIZE INTEGER-AS-LONG-READER.
    INITIALIZE LONG-READER.
    INITIALIZE FLOAT-READER.
    INITIALIZE FLOAT-AS-DOUBLE-READER.
    INITIALIZE DOUBLE-READER.
    INITIALIZE STRING-READER.
    INITIALIZE UTF8-READER.
    INITIALIZE ENUM-READER.
    INITIALIZE UUID-READER.
    INITIALIZE FIXED-READER.
    INITIALIZE GENERIC-FIXED-READER.
    INITIALIZE BYTES-READER.
    INITIALIZE BYTE-BUFFER-READER.
    INITIALIZE DECIMAL-READER.
    INITIALIZE UNION-READER.
    INITIALIZE ARRAY-READER.
    INITIALIZE ARRAY-MAP-READER.
    INITIALIZE MAP-READER.
    INITIALIZE RECORD-READER.
    INITIALIZE INDEXED-RECORD-READER.
    INITIALIZE PLANNED-RECORD-READER.
    INITIALIZE PLANNED-INDEXED-READER.
    INITIALIZE SKIP-STRUCT-READER.
    INITIALIZE POSITION-READER.