IDENTIFICATION DIVISION.
PROGRAM-ID. MAPPING-UTIL.

ENVIRONMENT DIVISION.

DATA DIVISION.
    COPY "ICEBERG-TYPES.COB".
    COPY "ICEBERG-SCHEMA.COB".
    COPY "ICEBERG-MAPPING.COB".

PROCEDURE DIVISION.

    CREATE-MAPPING SECTION.
        MOVE FUNCTION CREATE-MAPPING(SCHEMA) TO MAPPING.
        RETURN MAPPING.

    UPDATE-MAPPING SECTION.
        MOVE FUNCTION UPDATE-MAPPING(MAPPING, UPDATES, ADDS) TO MAPPING.
        RETURN MAPPING.

    INDEX-BY-ID SECTION.
        MOVE FUNCTION INDEX-BY-ID(MAPPED-FIELDS) TO ID-INDEX.
        RETURN ID-INDEX.

    INDEX-BY-NAME SECTION.
        MOVE FUNCTION INDEX-BY-NAME(MAPPED-FIELDS) TO NAME-INDEX.
        RETURN NAME-INDEX.

    VISIT-MAPPING SECTION.
        PERFORM VISIT-VISITOR VARYING VISITOR-TYPE FROM 1 BY 1 UNTIL VISITOR-TYPE > 3.
        RETURN VISITOR-RESULT.

    VISIT-FIELDS SECTION.
        PERFORM VISIT-VISITOR VARYING VISITOR-TYPE FROM 1 BY 1 UNTIL VISITOR-TYPE > 3.
        RETURN VISITOR-RESULT.

    VISIT-FIELD SECTION.
        PERFORM VISIT-VISITOR VARYING VISITOR-TYPE FROM 1 BY 1 UNTIL VISITOR-TYPE > 3.
        RETURN VISITOR-RESULT.

    ADD-NEW-FIELDS SECTION.
        PERFORM ADD-FIELDS VARYING FIELD-TO-ADD FROM 1 BY 1 UNTIL FIELD-TO-ADD > COUNT-OF-FIELDS-TO-ADD.
        RETURN UPDATED-MAPPED-FIELDS.

    REMOVE-REASSIGNED-NAMES SECTION.
        PERFORM REMOVE-NAME VARYING NAME-TO-REMOVE FROM 1 BY 1 UNTIL NAME-TO-REMOVE > COUNT-OF-NAMES-TO-REMOVE.
        RETURN UPDATED-MAPPED-FIELD.

    VISIT-VISITOR SECTION.
        EVALUATE VISITOR-TYPE
            WHEN 1 PERFORM VISIT-MAPPING-SECTION
            WHEN 2 PERFORM VISIT-FIELDS-SECTION
            WHEN 3 PERFORM VISIT-FIELD-SECTION
        END-EVALUATE.

    VISIT-MAPPING-SECTION.
        MOVE VISITOR-MAPPING(MAPPING) TO VISITOR-RESULT.
        EXIT.

    VISIT-FIELDS-SECTION.
        MOVE VISITOR-FIELDS(MAPPED-FIELDS, FIELD-RESULTS) TO VISITOR-RESULT.
        EXIT.

    VISIT-FIELD-SECTION.
        MOVE VISITOR-FIELD(MAPPED-FIELD, FIELD-RESULT) TO VISITOR-RESULT.
        EXIT.

    ADD-FIELDS SECTION.
        MOVE FUNCTION ADD-FIELD(FIELD-TO-ADD, UPDATED-MAPPED-FIELDS) TO UPDATED-MAPPED-FIELDS.
        EXIT.

    REMOVE-NAME SECTION.
        MOVE FUNCTION REMOVE-NAME(MAPPED-FIELD, NAME-TO-REMOVE) TO UPDATED-MAPPED-FIELD.
        EXIT.

STOP RUN.