IDENTIFICATION DIVISION.
PROGRAM-ID. EXPRESSIONS.

ENVIRONMENT DIVISION.
REPOSITORY.
    COPY "REFERENCE".
    COPY "LITERAL".
    COPY "EXPRESSIONS".

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-EXPR-AND.
   03 WS-EXPR-AND-LEFT USAGE IS OBJECT.
   03 WS-EXPR-AND-RIGHT USAGE IS OBJECT.
01 WS-EXPR-OR.
   03 WS-EXPR-OR-LEFT USAGE IS OBJECT.
   03 WS-EXPR-OR-RIGHT USAGE IS OBJECT.
01 WS-EXPR-NOT.
   03 WS-EXPR-NOT-CHILD USAGE IS OBJECT.

PROCEDURE DIVISION.

AND-EXPR.
    MOVE LEFT-EXPR TO WS-EXPR-AND-LEFT.
    MOVE RIGHT-EXPR TO WS-EXPR-AND-RIGHT.
    IF WS-EXPR-AND-LEFT = ALWAYSFALSE OR WS-EXPR-AND-RIGHT = ALWAYSFALSE THEN
        RETURN ALWAYSFALSE
    ELSE
        IF WS-EXPR-AND-LEFT = ALWAYSTRUE THEN
            RETURN WS-EXPR-AND-RIGHT
        ELSE
            IF WS-EXPR-AND-RIGHT = ALWAYSTRUE THEN
                RETURN WS-EXPR-AND-LEFT
            ELSE
                RETURN NEW AND(WS-EXPR-AND-LEFT, WS-EXPR-AND-RIGHT).

OR-EXPR.
    MOVE LEFT-EXPR TO WS-EXPR-OR-LEFT.
    MOVE RIGHT-EXPR TO WS-EXPR-OR-RIGHT.
    IF WS-EXPR-OR-LEFT = ALWAYSTRUE OR WS-EXPR-OR-RIGHT = ALWAYSTRUE THEN
        RETURN ALWAYSTRUE
    ELSE
        IF WS-EXPR-OR-LEFT = ALWAYSFALSE THEN
            RETURN WS-EXPR-OR-RIGHT
        ELSE
            IF WS-EXPR-OR-RIGHT = ALWAYSFALSE THEN
                RETURN WS-EXPR-OR-LEFT
            ELSE
                RETURN NEW OR(WS-EXPR-OR-LEFT, WS-EXPR-OR-RIGHT).

NOT-EXPR.
    MOVE CHILD-EXPR TO WS-EXPR-NOT-CHILD.
    IF WS-EXPR-NOT-CHILD = ALWAYSTRUE THEN
        RETURN ALWAYSFALSE
    ELSE
        IF WS-EXPR-NOT-CHILD = ALWAYSFALSE THEN
            RETURN ALWAYSTRUE
        ELSE
            IF WS-EXPR-NOT-CHILD IS NOT INSTANCE OF NOT THEN
                RETURN NEW NOT(WS-EXPR-NOT-CHILD)
            ELSE
                RETURN ((NOT)WS-EXPR-NOT-CHILD).CHILD().

BUCKET-EXPR.
    CALL TRANSFORMS-BUCKET USING NAME, NUM-BUCKETS RETURNING TRANSFORM.
    RETURN NEW UNBOUNDTRANSFORM(REF(NAME), TRANSFORM).

YEAR-EXPR.
    CALL TRANSFORMS-YEAR USING NAME RETURNING TRANSFORM.
    RETURN NEW UNBOUNDTRANSFORM(REF(NAME), TRANSFORM).

MONTH-EXPR.
    CALL TRANSFORMS-MONTH USING NAME RETURNING TRANSFORM.
    RETURN NEW UNBOUNDTRANSFORM(REF(NAME), TRANSFORM).

DAY-EXPR.
    CALL TRANSFORMS-DAY USING NAME RETURNING TRANSFORM.
    RETURN NEW UNBOUNDTRANSFORM(REF(NAME), TRANSFORM).

HOUR-EXPR.
    CALL TRANSFORMS-HOUR USING NAME RETURNING TRANSFORM.
    RETURN NEW UNBOUNDTRANSFORM(REF(NAME), TRANSFORM).

TRUNCATE-EXPR.
    RETURN NEW UNBOUNDTRANSFORM(REF(NAME), TRANSFORMS-TRUNCATE(WIDTH)).

EXTRACT-EXPR.
    RETURN NEW UNBOUNDEXTRACT(REF(NAME), PATH, TYPE).

ISNULL-EXPR.
    RETURN NEW UNBOUNDPREDICATE(ISNULL, REF(NAME)).

NOTNULL-EXPR.
    RETURN NEW UNBOUNDPREDICATE(NOTNULL, REF(NAME)).

ISNAN-EXPR.
    RETURN NEW UNBOUNDPREDICATE(ISNAN, REF(NAME)).

NOTNAN-EXPR.
    RETURN NEW UNBOUNDPREDICATE(NOTNAN, REF(NAME)).

LT-EXPR.
    RETURN NEW UNBOUNDPREDICATE(LT, REF(NAME), VALUE).

LTEQ-EXPR.
    RETURN NEW UNBOUNDPREDICATE(LTEQ, REF(NAME), VALUE).

GT-EXPR.
    RETURN NEW UNBOUNDPREDICATE(GT, REF(NAME), VALUE).

GTEQ-EXPR.
    RETURN NEW UNBOUNDPREDICATE(GTEQ, REF(NAME), VALUE).

EQ-EXPR.
    RETURN NEW UNBOUNDPREDICATE(EQ, REF(NAME), VALUE).

NEQ-EXPR.
    RETURN NEW UNBOUNDPREDICATE(NEQ, REF(NAME), VALUE).

STARTSWITH-EXPR.
    RETURN NEW UNBOUNDPREDICATE(STARTSWITH, REF(NAME), VALUE).

NOTSTARTSWITH-EXPR.
    RETURN NEW UNBOUNDPREDICATE(NOTSTARTSWITH, REF(NAME), VALUE).

IN-EXPR.
    RETURN NEW UNBOUNDPREDICATE(IN, REF(NAME), VALUES).

NOTIN-EXPR.
    RETURN NEW UNBOUNDPREDICATE(NOTIN, REF(NAME), VALUES).

PREDICATE-EXPR.
    PERFORM CASE OPERATION
        WHEN ISNULL THRU NOTNAN
            RETURN NEW UNBOUNDPREDICATE(OPERATION, REF(NAME))
        WHEN OTHER
            IF NANUTIL-ISNANAN(VALUE) THEN
                RAISE EXCEPTION "Invalid expression literal: NaN, use isNaN or notNaN instead"
            ELSE
                RETURN NEW UNBOUNDPREDICATE(OPERATION, REF(NAME), LITERAL(VALUE))
    END-PERFORM.

ALWAYSTRUE.
    RETURN TRUE-INSTANCE.

ALWAYSFALSE.
    RETURN FALSE-INSTANCE.

REWRITE-NOT.
    CALL EXPRESSIONVISITORS-VISIT USING EXPR, REWRITENOT RETURNING RESULT.
    RETURN RESULT.

REF-EXPR.
    RETURN NEW NAMEDREFERENCE(NAME).

TRANSFORM-EXPR.
    RETURN NEW UNBOUNDTRANSFORM(REF(NAME), TRANSFORM).

LIT-EXPR.
    RETURN LITERAL(VALUE).

COUNT-EXPR.
    RETURN NEW UNBOUNDAGGREGATE(COUNT, REF(NAME)).

COUNTSTAR-EXPR.
    RETURN NEW UNBOUNDAGGREGATE(COUNTSTAR, NULL).

MAX-EXPR.
    RETURN NEW UNBOUNDAGGREGATE(MAX, REF(NAME)).

MIN-EXPR.
    RETURN NEW UNBOUNDAGGREGATE(MIN, REF(NAME)).

STOP RUN.