IDENTIFICATION DIVISION.
PROGRAM-ID. COMPARATORS.

ENVIRONMENT DIVISION.
REPOSITORY.
    FUNCTION TYPE-ID IS TYPE-FUNCTIONS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 COMPARATORS-MAP.
    05 COMPARATORS-ENTRIES.
        10 BOOLEAN-TYPE PIC 9 VALUE 1.
        10 INTEGER-TYPE PIC 9 VALUE 2.
        10 LONG-TYPE PIC 9 VALUE 3.
        10 FLOAT-TYPE PIC 9 VALUE 4.
        10 DOUBLE-TYPE PIC 9 VALUE 5.
        10 DATE-TYPE PIC 9 VALUE 6.
        10 TIME-TYPE PIC 9 VALUE 7.
        10 TIMESTAMP-TYPE-WITH-ZONE PIC 9 VALUE 8.
        10 TIMESTAMP-TYPE-WITHOUT-ZONE PIC 9 VALUE 9.
        10 TIMESTAMP-NANO-TYPE-WITH-ZONE PIC 9 VALUE 10.
        10 TIMESTAMP-NANO-TYPE-WITHOUT-ZONE PIC 9 VALUE 11.
        10 STRING-TYPE PIC 9 VALUE 12.
        10 UUID-TYPE PIC 9 VALUE 13.
        10 BINARY-TYPE PIC 9 VALUE 14.
    05 COMPARATOR-VALUES.
        10 BOOLEAN-COMPARATOR PIC 9 VALUE 1.
        10 INTEGER-COMPARATOR PIC 9 VALUE 2.
        10 LONG-COMPARATOR PIC 9 VALUE 3.
        10 FLOAT-COMPARATOR PIC 9 VALUE 4.
        10 DOUBLE-COMPARATOR PIC 9 VALUE 5.
        10 DATE-COMPARATOR PIC 9 VALUE 6.
        10 TIME-COMPARATOR PIC 9 VALUE 7.
        10 TIMESTAMP-COMPARATOR-WITH-ZONE PIC 9 VALUE 8.
        10 TIMESTAMP-COMPARATOR-WITHOUT-ZONE PIC 9 VALUE 9.
        10 TIMESTAMP-NANO-COMPARATOR-WITH-ZONE PIC 9 VALUE 10.
        10 TIMESTAMP-NANO-COMPARATOR-WITHOUT-ZONE PIC 9 VALUE 11.
        10 STRING-COMPARATOR PIC 9 VALUE 12.
        10 UUID-COMPARATOR PIC 9 VALUE 13.
        10 BINARY-COMPARATOR PIC 9 VALUE 14.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY "COBOL Comparators Program".

    STOP RUN.

COPY "TYPE-FUNCTIONS.cob".