IDENTIFICATION DIVISION.
PROGRAM-ID. TYPES.

ENVIRONMENT DIVISION.

DATA DIVISION.
COPY "SCHEMA.CPY".
COPY "EXPRESSIONS.CPY".
COPY "LITERAL.CPY".

PROCEDURE DIVISION.

    IDENTIFICATION DIVISION.
    PROGRAM-ID. BOOLEANTYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 BOOLEANTYPE-INSTANCE PIC X(16) VALUE "BOOLEANTYPE-INSTANCE".
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. GET-BOOLEANTYPE.
        
        PROCEDURE DIVISION.
        
            MOVE BOOLEANTYPE-INSTANCE TO RETURN-CODE.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. INTEGERTYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 INTEGERTYPE-INSTANCE PIC X(16) VALUE "INTEGERTYPE-INSTANCE".
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. GET-INTEGERTYPE.
        
        PROCEDURE DIVISION.
        
            MOVE INTEGERTYPE-INSTANCE TO RETURN-CODE.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. LONGTYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 LONGTYPE-INSTANCE PIC X(16) VALUE "LONGTYPE-INSTANCE".
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. GET-LONGTYPE.
        
        PROCEDURE DIVISION.
        
            MOVE LONGTYPE-INSTANCE TO RETURN-CODE.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. FLOATTYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 FLOATTYPE-INSTANCE PIC X(16) VALUE "FLOATTYPE-INSTANCE".
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. GET-FLOATTYPE.
        
        PROCEDURE DIVISION.
        
            MOVE FLOATTYPE-INSTANCE TO RETURN-CODE.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. DOUBLETYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 DOUBLETYPE-INSTANCE PIC X(16) VALUE "DOUBLETYPE-INSTANCE".
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. GET-DOUBLETYPE.
        
        PROCEDURE DIVISION.
        
            MOVE DOUBLETYPE-INSTANCE TO RETURN-CODE.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. DATETYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 DATETYPE-INSTANCE PIC X(16) VALUE "DATETYPE-INSTANCE".
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. GET-DATETYPE.
        
        PROCEDURE DIVISION.
        
            MOVE DATETYPE-INSTANCE TO RETURN-CODE.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. TIMETYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 TIMETYPE-INSTANCE PIC X(16) VALUE "TIMETYPE-INSTANCE".
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. GET-TIMETYPE.
        
        PROCEDURE DIVISION.
        
            MOVE TIMETYPE-INSTANCE TO RETURN-CODE.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. TIMESTAMPTYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 TIMESTAMPTYPE-INSTANCE-WITH-ZONE PIC X(16) VALUE "TIMESTAMPTYPE-INSTANCE-WITH-ZONE".
    01 TIMESTAMPTYPE-INSTANCE-WITHOUT-ZONE PIC X(16) VALUE "TIMESTAMPTYPE-INSTANCE-WITHOUT-ZONE".
    01 WS-ADJUST-TO-UTC PIC 9(1) VALUE 0.
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. TIMESTAMPTYPE-WITH-ZONE.
        
        PROCEDURE DIVISION.
        
            MOVE TIMESTAMPTYPE-INSTANCE-WITH-ZONE TO RETURN-CODE.
            MOVE 1 TO WS-ADJUST-TO-UTC.
            GOBACK.
        
        IDENTIFICATION DIVISION.
        PROGRAM-ID. TIMESTAMPTYPE-WITHOUT-ZONE.
        
        PROCEDURE DIVISION.
        
            MOVE TIMESTAMPTYPE-INSTANCE-WITHOUT-ZONE TO RETURN-CODE.
            MOVE 0 TO WS-ADJUST-TO-UTC.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. TIMESTAMPNANOTYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 TIMESTAMPNANOTYPE-INSTANCE-WITH-ZONE PIC X(16) VALUE "TIMESTAMPNANOTYPE-INSTANCE-WITH-ZONE".
    01 TIMESTAMPNANOTYPE-INSTANCE-WITHOUT-ZONE PIC X(16) VALUE "TIMESTAMPNANOTYPE-INSTANCE-WITHOUT-ZONE".
    01 WS-ADJUST-TO-UTC PIC 9(1) VALUE 0.
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. TIMESTAMPNANOTYPE-WITH-ZONE.
        
        PROCEDURE DIVISION.
        
            MOVE TIMESTAMPNANOTYPE-INSTANCE-WITH-ZONE TO RETURN-CODE.
            MOVE 1 TO WS-ADJUST-TO-UTC.
            GOBACK.
        
        IDENTIFICATION DIVISION.
        PROGRAM-ID. TIMESTAMPNANOTYPE-WITHOUT-ZONE.
        
        PROCEDURE DIVISION.
        
            MOVE TIMESTAMPNANOTYPE-INSTANCE-WITHOUT-ZONE TO RETURN-CODE.
            MOVE 0 TO WS-ADJUST-TO-UTC.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. STRINGTYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 STRINGTYPE-INSTANCE PIC X(16) VALUE "STRINGTYPE-INSTANCE".
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. GET-STRINGTYPE.
        
        PROCEDURE DIVISION.
        
            MOVE STRINGTYPE-INSTANCE TO RETURN-CODE.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. UUIDTYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 UUIDTYPE-INSTANCE PIC X(16) VALUE "UUIDTYPE-INSTANCE".
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. GET-UUIDTYPE.
        
        PROCEDURE DIVISION.
        
            MOVE UUIDTYPE-INSTANCE TO RETURN-CODE.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. FIXEDTYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 WS-LENGTH PIC 9(9) VALUE 0.
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. FIXEDTYPE-OF-LENGTH.
        
        DATA DIVISION.
        01 PARAM-LENGTH PIC 9(9) VALUE 0.
        
        PROCEDURE DIVISION USING PARAM-LENGTH.
        
            MOVE PARAM-LENGTH TO WS-LENGTH.
            PERFORM FIXEDTYPE-INIT.
            GOBACK.
        
        IDENTIFICATION DIVISION.
        PROGRAM-ID. FIXEDTYPE-INIT.
        
        PROCEDURE DIVISION.
        
            PERFORM FIXEDTYPE-PROGRAM.
            GOBACK.
        
        IDENTIFICATION DIVISION.
        PROGRAM-ID. FIXEDTYPE-PROGRAM.
        
        PROCEDURE DIVISION.
        
            COMPUTE RETURN-CODE = FUNCTION LENGTH(FUNCTION STRING(WS-LENGTH)).
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. BINARYTYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 BINARYTYPE-INSTANCE PIC X(16) VALUE "BINARYTYPE-INSTANCE".
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. GET-BINARYTYPE.
        
        PROCEDURE DIVISION.
        
            MOVE BINARYTYPE-INSTANCE TO RETURN-CODE.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. VARIANTTYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 VARIANTTYPE-INSTANCE PIC X(16) VALUE "VARIANTTYPE-INSTANCE".
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. GET-VARIANTTYPE.
        
        PROCEDURE DIVISION.
        
            MOVE VARIANTTYPE-INSTANCE TO RETURN-CODE.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. UNKNOWNTYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 UNKNOWNTYPE-INSTANCE PIC X(16) VALUE "UNKNOWNTYPE-INSTANCE".
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. GET-UNKNOWNTYPE.
        
        PROCEDURE DIVISION.
        
            MOVE UNKNOWNTYPE-INSTANCE TO RETURN-CODE.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. DECIMALTYPE.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 WS-PRECISION PIC 9(9) VALUE 0.
    01 WS-SCALE PIC 9(9) VALUE 0.
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. DECIMALTYPE-OF.
        
        DATA DIVISION.
        01 PARAM-PRECISION PIC 9(9) VALUE 0.
        01 PARAM-SCALE PIC 9(9) VALUE 0.
        
        PROCEDURE DIVISION USING PARAM-PRECISION, PARAM-SCALE.
        
            MOVE PARAM-PRECISION TO WS-PRECISION.
            MOVE PARAM-SCALE TO WS-SCALE.
            PERFORM DECIMALTYPE-INIT.
            GOBACK.
        
        IDENTIFICATION DIVISION.
        PROGRAM-ID. DECIMALTYPE-INIT.
        
        PROCEDURE DIVISION.
        
            PERFORM DECIMALTYPE-PROGRAM.
            GOBACK.
        
        IDENTIFICATION DIVISION.
        PROGRAM-ID. DECIMALTYPE-PROGRAM.
        
        PROCEDURE DIVISION.
        
            COMPUTE RETURN-CODE = (WS-PRECISION * 100) + WS-SCALE.
            GOBACK.
        
    IDENTIFICATION DIVISION.
    PROGRAM-ID. NESTEDFIELD.
    
    ENVIRONMENT DIVISION.
    
    DATA DIVISION.
    01 WS-IS-OPTIONAL PIC 9(1) VALUE 0.
    01 WS-ID PIC 9(9) VALUE 0.
    01 WS-NAME PIC X(256) VALUE SPACES.
    01 WS-TYPE PIC X(256) VALUE SPACES.
    01 WS-DOC PIC X(1024) VALUE SPACES.
    01 WS-INITIAL-DEFAULT PIC X(256) VALUE SPACES.
    01 WS-WRITE-DEFAULT PIC X(256) VALUE SPACES.
    
    PROCEDURE DIVISION.
    
        IDENTIFICATION DIVISION.
        PROGRAM-ID. NESTEDFIELD-OPTIONAL.
        
        DATA DIVISION.
        01 PARAM-ID PIC 9(9) VALUE 0.
        01 PARAM-NAME PIC X(256) VALUE SPACES.
        01 PARAM-TYPE PIC X(256) VALUE SPACES.
        
        PROCEDURE DIVISION USING PARAM-ID, PARAM-NAME, PARAM-TYPE.
        
            MOVE 1 TO WS-IS-OPTIONAL.
            MOVE PARAM-ID TO WS-ID.
            MOVE PARAM-NAME TO WS-NAME.
            MOVE PARAM-TYPE TO WS-TYPE.
            MOVE SPACES TO WS-DOC.
            MOVE SPACES TO WS-INITIAL-DEFAULT.
            MOVE SPACES TO WS-WRITE-DEFAULT.
            PERFORM NESTEDFIELD-INIT.
            GOBACK.
        
        IDENTIFICATION DIVISION.
        PROGRAM-ID. NESTEDFIELD-REQUIRED.
        
        DATA DIVISION.
        01 PARAM-ID PIC 9(9) VALUE 0.
        01 PARAM-NAME PIC X(256) VALUE SPACES.
        01 PARAM-TYPE PIC X(256) VALUE SPACES.
        
        PROCEDURE DIVISION USING PARAM-ID, PARAM-NAME, PARAM-TYPE.
        
            MOVE 0 TO WS-IS-OPTIONAL.
            MOVE PARAM-ID TO WS-ID.
            MOVE PARAM-NAME TO WS-NAME.
            MOVE PARAM-TYPE TO WS-TYPE.
            MOVE SPACES TO WS-DOC.
            MOVE SPACES TO WS-INITIAL-DEFAULT.
            MOVE SPACES TO WS-WRITE-DEFAULT.
            PERFORM NESTEDFIELD-INIT.
            GOBACK.
        
        IDENTIFICATION DIVISION.
        PROGRAM-ID. NESTEDFIELD-OPTIONAL-WITH-DOC.
        
        DATA DIVISION.
        01 PARAM-ID PIC 9(9) VALUE 0.
        01 PARAM-NAME PIC X(256) VALUE SPACES.
        01 PARAM-TYPE PIC X(256) VALUE SPACES.
        01 PARAM-DOC PIC X(1024) VALUE SPACES.
        
        PROCEDURE DIVISION USING PARAM-ID, PARAM-NAME, PARAM-TYPE, PARAM-DOC.
        
            MOVE 1 TO WS-IS-OPTIONAL.
            MOVE PARAM-ID TO WS-ID.
            MOVE PARAM-NAME TO WS-NAME.
            MOVE PARAM-TYPE TO WS-TYPE.
            MOVE PARAM-DOC TO WS-DOC.
            MOVE SPACES TO WS-INITIAL-DEFAULT.
            MOVE SPACES TO WS-WRITE-DEFAULT.
            PERFORM NESTEDFIELD-INIT.
            GOBACK.
        
        IDENTIFICATION DIVISION.
        PROGRAM-ID. NESTEDFIELD-REQUIRED-WITH-DOC.
        
        DATA DIVISION.
        01 PARAM-ID PIC 9(9) VALUE 0.
        01 PARAM-NAME PIC X(256) VALUE SPACES.
        01 PARAM-TYPE PIC X(256) VALUE SPACES.
        01 PARAM-DOC PIC X(1024) VALUE SPACES.
        
        PROCEDURE DIVISION USING PARAM-ID, PARAM-NAME, PARAM-TYPE, PARAM-DOC.
        
            MOVE 0 TO WS-IS-OPTIONAL.
            MOVE PARAM-ID TO WS-ID.
            MOVE PARAM-NAME TO WS-NAME.
            MOVE PARAM-TYPE TO WS-TYPE.
            MOVE PARAM-DOC TO WS-DOC.
            MOVE SPACES TO WS-INITIAL-DEFAULT.
            MOVE SPACES TO WS-WRITE-DEFAULT.
            PERFORM NESTEDFIELD-INIT.
            GOBACK.
        
        IDENTIFICATION DIVISION.
        PROGRAM-ID. NESTEDFIELD-INIT.