IDENTIFICATION DIVISION.
PROGRAM-ID. JDBCUTIL.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT CATALOG-TABLE-VIEW
        ASSIGN TO EXTERNAL CATALOG-TABLE-VIEW-NAME
        ORGANIZATION IS INDEXED
        ACCESS MODE IS DYNAMIC
        RECORD KEY IS CATALOG-NAME, TABLE-NAMESPACE, TABLE-NAME
        FILE STATUS IS CATALOG-TABLE-VIEW-STATUS.

    SELECT NAMESPACE-PROPERTIES-TABLE
        ASSIGN TO EXTERNAL NAMESPACE-PROPERTIES-TABLE-NAME
        ORGANIZATION IS INDEXED
        ACCESS MODE IS DYNAMIC
        RECORD KEY IS CATALOG-NAME, NAMESPACE-NAME, NAMESPACE-PROPERTY-KEY
        FILE STATUS IS NAMESPACE-PROPERTIES-TABLE-STATUS.

DATA DIVISION.
FILE SECTION.
FD  CATALOG-TABLE-VIEW.
01  CATALOG-TABLE-VIEW-REC.
    05 CATALOG-NAME PIC X(255).
    05 TABLE-NAMESPACE PIC X(255).
    05 TABLE-NAME PIC X(255).
    05 METADATA-LOCATION PIC X(1000).
    05 PREVIOUS-METADATA-LOCATION PIC X(1000).
    05 RECORD-TYPE PIC X(5).

FD  NAMESPACE-PROPERTIES-TABLE.
01  NAMESPACE-PROPERTIES-REC.
    05 CATALOG-NAME PIC X(255).
    05 NAMESPACE-NAME PIC X(255).
    05 NAMESPACE-PROPERTY-KEY PIC X(255).
    05 NAMESPACE-PROPERTY-VALUE PIC X(1000).

WORKING-STORAGE SECTION.
01  CATALOG-TABLE-VIEW-STATUS PIC XX.
01  NAMESPACE-PROPERTIES-TABLE-STATUS PIC XX.

01  STRICT-MODE-PROPERTY PIC X(255) VALUE "strict-mode".
01  SCHEMA-VERSION-PROPERTY PIC X(255) VALUE "schema-version".
01  INIT-CATALOG-TABLES-PROPERTY PIC X(255) VALUE "init-catalog-tables".
01  RETRYABLE-STATUS-CODES PIC X(255) VALUE "retryable_status_codes".

01  CATALOG-TABLE-VIEW-NAME PIC X(255) VALUE "iceberg_tables".
01  CATALOG-NAME PIC X(255).
01  TABLE-NAME PIC X(255).
01  TABLE-NAMESPACE PIC X(255).
01  RECORD-TYPE PIC X(5).
01  TABLE-RECORD-TYPE PIC X(5) VALUE "TABLE".
01  VIEW-RECORD-TYPE PIC X(5) VALUE "VIEW".

01  V1-DO-COMMIT-TABLE-SQL PIC X(1000).
01  V1-DO-COMMIT-VIEW-SQL PIC X(1000).
01  V0-DO-COMMIT-SQL PIC X(1000).
01  V0-CREATE-CATALOG-SQL PIC X(1000).
01  V1-UPDATE-CATALOG-SQL PIC X(1000).

01  GET-VIEW-SQL PIC X(1000).
01  V1-GET-TABLE-SQL PIC X(1000).
01  V0-GET-TABLE-SQL PIC X(1000).
01  LIST-VIEW-SQL PIC X(1000).
01  V1-LIST-TABLE-SQL PIC X(1000).
01  V0-LIST-TABLE-SQL PIC X(1000).
01  RENAME-VIEW-SQL PIC X(1000).
01  V1-RENAME-TABLE-SQL PIC X(1000).
01  V0-RENAME-TABLE-SQL PIC X(1000).
01  DROP-VIEW-SQL PIC X(1000).
01  V1-DROP-TABLE-SQL PIC X(1000).
01  V0-DROP-TABLE-SQL PIC X(1000).
01  GET-NAMESPACE-SQL PIC X(1000).
01  LIST-NAMESPACES-SQL PIC X(1000).
01  LIST-ALL-NAMESPACES-SQL PIC X(1000).
01  V1-DO-COMMIT-CREATE-SQL PIC X(1000).
01  V0-DO-COMMIT-CREATE-SQL PIC X(1000).

01  NAMESPACE-PROPERTIES-TABLE-NAME PIC X(255) VALUE "iceberg_namespace_properties".
01  NAMESPACE-NAME PIC X(255).
01  NAMESPACE-PROPERTY-KEY PIC X(255).
01  NAMESPACE-PROPERTY-VALUE PIC X(1000).

01  CREATE-NAMESPACE-PROPERTIES-TABLE-SQL PIC X(1000).
01  GET-NAMESPACE-PROPERTIES-SQL PIC X(1000).
01  INSERT-NAMESPACE-PROPERTIES-SQL PIC X(1000).
01  INSERT-PROPERTIES-VALUES-BASE PIC X(100) VALUE "(?,?,?,?)".
01  GET-ALL-NAMESPACE-PROPERTIES-SQL PIC X(1000).
01  DELETE-NAMESPACE-PROPERTIES-SQL PIC X(1000).
01  DELETE-ALL-NAMESPACE-PROPERTIES-SQL PIC X(1000).
01  LIST-PROPERTY-NAMESPACES-SQL PIC X(1000).
01  LIST-ALL-PROPERTY-NAMESPACES-SQL PIC X(1000).

PROCEDURE DIVISION.

COPY-STATEMENTS.
COPY "ODBCCONNECTION.cpy" REPLACING ==:CATALOG-NAME:== BY ==CATALOG-NAME==
                                   ==:TABLE-NAMESPACE:== BY ==TABLE-NAMESPACE==
                                   ==:TABLE-NAME:== BY ==TABLE-NAME==
                                   ==:METADATA-LOCATION:== BY ==METADATA-LOCATION==
                                   ==:PREVIOUS-METADATA-LOCATION:== BY ==PREVIOUS-METADATA-LOCATION==
                                   ==:RECORD-TYPE:== BY ==RECORD-TYPE==
                                   ==:NAMESPACE-NAME:== BY ==NAMESPACE-NAME==
                                   ==:NAMESPACE-PROPERTY-KEY:== BY ==NAMESPACE-PROPERTY-KEY==
                                   ==:NAMESPACE-PROPERTY-VALUE:== BY ==NAMESPACE-PROPERTY-VALUE==.

END PROGRAM JDBCUTIL.