IDENTIFICATION DIVISION.
PROGRAM-ID. SINGLEVALUEPARSER.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 KEYS-CONST PIC X(5) VALUE "keys".
01 VALUES-CONST PIC X(6) VALUE "values".

01 CURRENT-ELEMENT PIC X(1).
01 CURRENT-ELEMENT-INDEX PIC 9(9) COMP.
01 CURRENT-ELEMENT-COUNT PIC 9(9) COMP.

01 TEMP-DECIMAL PIC S9(38)V9(38) COMP-3.
01 TEMP-TIMESTAMP PIC 9(18) COMP-3.
01 TEMP-UUID PIC X(36).
01 TEMP-FIXED-BYTES PIC X(16).
01 TEMP-BINARY-BYTES PIC X(16).

01 DEFAULT-VALUE-STORAGE.
   03 DEFAULT-VALUE-TYPE PIC X.
      88 DEFAULT-VALUE-IS-NULL VALUE "N".
      88 DEFAULT-VALUE-IS-BOOLEAN VALUE "B".
      88 DEFAULT-VALUE-IS-INTEGER VALUE "I".
      88 DEFAULT-VALUE-IS-LONG VALUE "L".
      88 DEFAULT-VALUE-IS-FLOAT VALUE "F".
      88 DEFAULT-VALUE-IS-DOUBLE VALUE "D".
      88 DEFAULT-VALUE-IS-DECIMAL VALUE "E".
      88 DEFAULT-VALUE-IS-STRING VALUE "S".
      88 DEFAULT-VALUE-IS-UUID VALUE "U".
      88 DEFAULT-VALUE-IS-DATE VALUE "T".
      88 DEFAULT-VALUE-IS-TIME VALUE "V".
      88 DEFAULT-VALUE-IS-TIMESTAMP VALUE "W".
      88 DEFAULT-VALUE-IS-FIXED VALUE "X".
      88 DEFAULT-VALUE-IS-BINARY VALUE "Y".
      88 DEFAULT-VALUE-IS-LIST VALUE "Z".
      88 DEFAULT-VALUE-IS-MAP VALUE "M".
      88 DEFAULT-VALUE-IS-STRUCT VALUE "C".
   03 DEFAULT-VALUE-BOOLEAN PIC X.
   03 DEFAULT-VALUE-INTEGER PIC S9(9) COMP.
   03 DEFAULT-VALUE-LONG PIC S9(18) COMP.
   03 DEFAULT-VALUE-FLOAT PIC S9(9)V9(9) COMP-1.
   03 DEFAULT-VALUE-DOUBLE PIC S9(9)V9(9) COMP-2.
   03 DEFAULT-VALUE-DECIMAL-SCALE PIC 9(9) COMP.
   03 DEFAULT-VALUE-DECIMAL-BYTES PIC X(40).
   03 DEFAULT-VALUE-STRING PIC X(256).
   03 DEFAULT-VALUE-UUID PIC X(36).
   03 DEFAULT-VALUE-DATE PIC 9(9) COMP.
   03 DEFAULT-VALUE-TIME PIC 9(18) COMP.
   03 DEFAULT-VALUE-TIMESTAMP PIC 9(18) COMP.
   03 DEFAULT-VALUE-FIXED-LENGTH PIC 9(9) COMP.
   03 DEFAULT-VALUE-FIXED-BYTES PIC X(16).
   03 DEFAULT-VALUE-BINARY-BYTES PIC X(16).
   03 DEFAULT-VALUE-LIST-COUNT PIC 9(9) COMP.
   03 DEFAULT-VALUE-MAP-KEY-COUNT PIC 9(9) COMP.
   03 DEFAULT-VALUE-MAP-VALUE-COUNT PIC 9(9) COMP.
   03 DEFAULT-VALUE-STRUCT-COUNT PIC 9(9) COMP.
   03 DEFAULT-VALUE-STRUCT-FIELD-ID PIC 9(9) COMP.
   03 DEFAULT-VALUE-STRUCT-FIELD-VALUE PIC X(256).

PROCEDURE DIVISION.

MAIN-PROCEDURE SECTION.
    PERFORM FROM-JSON.
    GOBACK.

FROM-JSON SECTION.
    MOVE SPACE TO DEFAULT-VALUE-STORAGE.
    PERFORM POPULATE-DEFAULT-VALUE.
    PERFORM GENERATE-JSON.
    GOBACK.

POPULATE-DEFAULT-VALUE SECTION.
    EVALUATE TRUE
        WHEN DEFAULT-VALUE-IS-NULL
            MOVE "N" TO DEFAULT-VALUE-TYPE
        WHEN DEFAULT-VALUE-IS-BOOLEAN
            MOVE "B" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-BOOLEAN TO DEFAULT-VALUE-BOOLEAN
        WHEN DEFAULT-VALUE-IS-INTEGER
            MOVE "I" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-INTEGER TO DEFAULT-VALUE-INTEGER
        WHEN DEFAULT-VALUE-IS-LONG
            MOVE "L" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-LONG TO DEFAULT-VALUE-LONG
        WHEN DEFAULT-VALUE-IS-FLOAT
            MOVE "F" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-FLOAT TO DEFAULT-VALUE-FLOAT
        WHEN DEFAULT-VALUE-IS-DOUBLE
            MOVE "D" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-DOUBLE TO DEFAULT-VALUE-DOUBLE
        WHEN DEFAULT-VALUE-IS-DECIMAL
            MOVE "E" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-DECIMAL-SCALE TO DEFAULT-VALUE-DECIMAL-SCALE
            MOVE DEFAULTVALUE-DECIMAL-BYTES TO DEFAULT-VALUE-DECIMAL-BYTES
        WHEN DEFAULT-VALUE-IS-STRING
            MOVE "S" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-STRING TO DEFAULT-VALUE-STRING
        WHEN DEFAULT-VALUE-IS-UUID
            MOVE "U" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-UUID TO DEFAULT-VALUE-UUID
        WHEN DEFAULT-VALUE-IS-DATE
            MOVE "T" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-DATE TO DEFAULT-VALUE-DATE
        WHEN DEFAULT-VALUE-IS-TIME
            MOVE "V" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-TIME TO DEFAULT-VALUE-TIME
        WHEN DEFAULT-VALUE-IS-TIMESTAMP
            MOVE "W" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-TIMESTAMP TO DEFAULT-VALUE-TIMESTAMP
        WHEN DEFAULT-VALUE-IS-FIXED
            MOVE "X" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-FIXED-LENGTH TO DEFAULT-VALUE-FIXED-LENGTH
            MOVE DEFAULTVALUE-FIXED-BYTES TO DEFAULT-VALUE-FIXED-BYTES
        WHEN DEFAULT-VALUE-IS-BINARY
            MOVE "Y" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-BINARY-BYTES TO DEFAULT-VALUE-BINARY-BYTES
        WHEN DEFAULT-VALUE-IS-LIST
            MOVE "Z" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-LIST-COUNT TO DEFAULT-VALUE-LIST-COUNT
        WHEN DEFAULT-VALUE-IS-MAP
            MOVE "M" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-MAP-KEY-COUNT TO DEFAULT-VALUE-MAP-KEY-COUNT
            MOVE DEFAULTVALUE-MAP-VALUE-COUNT TO DEFAULT-VALUE-MAP-VALUE-COUNT
        WHEN DEFAULT-VALUE-IS-STRUCT
            MOVE "C" TO DEFAULT-VALUE-TYPE
            MOVE DEFAULTVALUE-STRUCT-COUNT TO DEFAULT-VALUE-STRUCT-COUNT
            MOVE DEFAULTVALUE-STRUCT-FIELD-ID TO DEFAULT-VALUE-STRUCT-FIELD-ID
            MOVE DEFAULTVALUE-STRUCT-FIELD-VALUE TO DEFAULT-VALUE-STRUCT-FIELD-VALUE
    END-EVALUATE.

GENERATE-JSON SECTION.
    EVALUATE DEFAULT-VALUE-TYPE
        WHEN "N"
            MOVE SPACE TO DEFAULT-VALUE-STRING
        WHEN "B"
            MOVE DEFAULT-VALUE-BOOLEAN TO DEFAULT-VALUE-STRING
        WHEN "I"
            MOVE DEFAULT-VALUE-INTEGER TO DEFAULT-VALUE-STRING
        WHEN "L"
            MOVE DEFAULT-VALUE-LONG TO DEFAULT-VALUE-STRING
        WHEN "F"
            MOVE DEFAULT-VALUE-FLOAT TO DEFAULT-VALUE-STRING
        WHEN "D"
            MOVE DEFAULT-VALUE-DOUBLE TO DEFAULT-VALUE-STRING
        WHEN "E"
            MOVE DEFAULT-VALUE-DECIMAL-BYTES TO DEFAULT-VALUE-STRING
        WHEN "S"
            MOVE DEFAULT-VALUE-STRING TO DEFAULT-VALUE-STRING
        WHEN "U"
            MOVE DEFAULT-VALUE-UUID TO DEFAULT-VALUE-STRING
        WHEN "T"
            MOVE DEFAULT-VALUE-DATE TO DEFAULT-VALUE-STRING
        WHEN "V"
            MOVE DEFAULT-VALUE-TIME TO DEFAULT-VALUE-STRING
        WHEN "W"
            MOVE DEFAULT-VALUE-TIMESTAMP TO DEFAULT-VALUE-STRING
        WHEN "X"
            MOVE DEFAULT-VALUE-FIXED-BYTES TO TEMP-FIXED-BYTES
            MOVE TEMP-FIXED-BYTES TO DEFAULT-VALUE-STRING
        WHEN "Y"
            MOVE DEFAULT-VALUE-BINARY-BYTES TO TEMP-BINARY-BYTES
            MOVE TEMP-BINARY-BYTES TO DEFAULT-VALUE-STRING
        WHEN "Z"
            PERFORM SERIALIZE-LIST
        WHEN "M"
            PERFORM SERIALIZE-MAP
        WHEN "C"
            PERFORM SERIALIZE-STRUCT
    END-EVALUATE.

SERIALIZE-LIST SECTION.
    MOVE SPACE TO DEFAULT-VALUE-STRING
    PERFORM VARYING CURRENT-ELEMENT-INDEX FROM 1 BY 1 UNTIL CURRENT-ELEMENT-INDEX > DEFAULT-VALUE-LIST-COUNT
        MOVE CURRENT-ELEMENT-INDEX TO CURRENT-ELEMENT
        PERFORM GENERATE-JSON
        MOVE DEFAULT-VALUE-STRING TO TEMP-STRING
        STRING "[" TEMP-STRING "]" INTO DEFAULT-VALUE-STRING
    END-PERFORM.

SERIALIZE-MAP SECTION.
    MOVE SPACE TO DEFAULT-VALUE-STRING
    MOVE 1 TO CURRENT-ELEMENT-INDEX
    MOVE 1 TO CURRENT-ELEMENT-COUNT
    PERFORM UNTIL CURRENT-ELEMENT-INDEX > DEFAULT-VALUE-MAP-KEY-COUNT
        PERFORM GENERATE-JSON
        MOVE DEFAULT-VALUE-STRING TO TEMP-STRING
        STRING "[" TEMP-STRING "]" INTO DEFAULT-VALUE-STRING
        ADD 1 TO CURRENT-ELEMENT-INDEX
        ADD 1 TO CURRENT-ELEMENT-COUNT
    END-PERFORM
    MOVE 1 TO CURRENT-ELEMENT-INDEX
    PERFORM UNTIL CURRENT-ELEMENT-INDEX > DEFAULT-VALUE-MAP-VALUE-COUNT
        PERFORM GENERATE-JSON
        MOVE DEFAULT-VALUE-STRING TO TEMP-STRING
        STRING "[" TEMP-STRING "]" INTO DEFAULT-VALUE-STRING
        ADD 1 TO CURRENT-ELEMENT-INDEX
    END-PERFORM.

SERIALIZE-STRUCT SECTION.
    MOVE SPACE TO DEFAULT-VALUE-STRING
    MOVE 1 TO CURRENT-ELEMENT-INDEX
    MOVE 1 TO CURRENT-ELEMENT-COUNT
    PERFORM UNTIL CURRENT-ELEMENT-INDEX > DEFAULT-VALUE-STRUCT-COUNT
        MOVE DEFAULT-VALUE-STRUCT-FIELD-ID TO TEMP-STRING
        STRING "{" TEMP-STRING ":" INTO DEFAULT-VALUE-STRING
        PERFORM GENERATE-JSON
        STRING "}" INTO DEFAULT-VALUE-STRING
        ADD 1 TO CURRENT-ELEMENT-INDEX
        ADD 1 TO CURRENT-ELEMENT-COUNT
    END-PERFORM.

END PROGRAM SINGLEVALUEPARSER.