IDENTIFICATION DIVISION.
PROGRAM-ID. V1METADATA.

ENVIRONMENT DIVISION.
REPOSITORY.
    CLASS MANIFESTFILEITEMWRAPPER IS "org.apache.iceberg.V1Metadata$ManifestFileWrapper".
    CLASS MANIFESTENTRYWRAPPER IS "org.apache.iceberg.V1Metadata$ManifestEntryWrapper".
    CLASS DATAFILEWRAPPER IS "org.apache.iceberg.V1Metadata$DataFileWrapper".

DATA DIVISION.
WORKING-STORAGE SECTION.
01 MANIFEST-LIST-SCHEMA.
    03 MANIFEST-FILE-PATH             PIC X(1024).
    03 MANIFEST-FILE-LENGTH           PIC 9(18) COMP-3.
    03 MANIFEST-SPEC-ID               PIC 9(9) COMP.
    03 MANIFEST-SNAPSHOT-ID          PIC 9(18) COMP-3.
    03 MANIFEST-ADDED-FILES-COUNT     PIC 9(9) COMP.
    03 MANIFEST-EXISTING-FILES-COUNT  PIC 9(9) COMP.
    03 MANIFEST-DELETED-FILES-COUNT   PIC 9(9) COMP.
    03 MANIFEST-PARTITION-SUMMARIES   PIC X(1024).
    03 MANIFEST-ADDED-ROWS-COUNT      PIC 9(18) COMP-3.
    03 MANIFEST-EXISTING-ROWS-COUNT   PIC 9(18) COMP-3.
    03 MANIFEST-DELETED-ROWS-COUNT    PIC 9(18) COMP-3.
    03 MANIFEST-KEY-METADATA          PIC X(1024).

01 DATAFILE-SCHEMA.
    03 DATAFILE-PATH                  PIC X(1024).
    03 DATAFILE-FORMAT                PIC X(32).
    03 DATAFILE-PARTITION             PIC X(1024).
    03 DATAFILE-RECORD-COUNT          PIC 9(18) COMP-3.
    03 DATAFILE-SIZE                  PIC 9(18) COMP-3.
    03 DATAFILE-BLOCK-SIZE            PIC 9(18) COMP-3.
    03 DATAFILE-COLUMN-SIZES          PIC X(1024).
    03 DATAFILE-VALUE-COUNTS          PIC X(1024).
    03 DATAFILE-NULL-VALUE-COUNTS     PIC X(1024).
    03 DATAFILE-NAN-VALUE-COUNTS      PIC X(1024).
    03 DATAFILE-LOWER-BOUNDS          PIC X(1024).
    03 DATAFILE-UPPER-BOUNDS          PIC X(1024).
    03 DATAFILE-KEY-METADATA          PIC X(1024).
    03 DATAFILE-SPLIT-OFFSETS         PIC X(1024).
    03 DATAFILE-SORT-ORDER-ID         PIC 9(9) COMP.

01 ENTRY-SCHEMA.
    03 ENTRY-STATUS                   PIC 9(9) COMP.
    03 ENTRY-SNAPSHOT-ID              PIC 9(18) COMP-3.
    03 ENTRY-DATA-FILE                USAGE POINTER.

PROCEDURE DIVISION.
    CALL "DECLAREINDICATOR" USING MANIFESTFILEITEMWRAPPER.
    CALL "DECLAREINDICATOR" USING MANIFESTENTRYWRAPPER.
    CALL "DECLAREINDICATOR" USING DATAFILEWRAPPER.

    STOP RUN.