IDENTIFICATION DIVISION.
PROGRAM-ID. TRUNCATE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-WIDTH PIC 9(9) COMP.
01 WS-UNSCALED-WIDTH PIC X(30) COMP.

PROCEDURE DIVISION.

IDENTIFICATION DIVISION.
PROGRAM-ID. TRUNCATE-INTEGER.

PROCEDURE DIVISION USING INTEGER.
  IF INTEGER IS NULL
    RETURN NULL.
  COMPUTE INTEGER = TRUNCATE-UTIL-TRUNCATE-INT(WS-WIDTH, INTEGER).
  RETURN INTEGER.

IDENTIFICATION DIVISION.
PROGRAM-ID. TRUNCATE-LONG.

PROCEDURE DIVISION USING LONG.
  IF LONG IS NULL
    RETURN NULL.
  COMPUTE LONG = TRUNCATE-UTIL-TRUNCATE-LONG(WS-WIDTH, LONG).
  RETURN LONG.

IDENTIFICATION DIVISION.
PROGRAM-ID. TRUNCATE-STRING.

PROCEDURE DIVISION USING CHAR-SEQUENCE.
  IF CHAR-SEQUENCE IS NULL
    RETURN NULL.
  COMPUTE CHAR-SEQUENCE = UNICODE-UTIL-TRUNCATE-STRING(CHAR-SEQUENCE, WS-WIDTH).
  RETURN CHAR-SEQUENCE.

IDENTIFICATION DIVISION.
PROGRAM-ID. TRUNCATE-BYTE-BUFFER.

PROCEDURE DIVISION USING BYTE-BUFFER.
  IF BYTE-BUFFER IS NULL
    RETURN NULL.
  COMPUTE BYTE-BUFFER = BINARY-UTIL-TRUNCATE-BINARY-UNSAFE(BYTE-BUFFER, WS-WIDTH).
  RETURN BYTE-BUFFER.

IDENTIFICATION DIVISION.
PROGRAM-ID. TRUNCATE-DECIMAL.

PROCEDURE DIVISION USING BIG-DECIMAL.
  IF BIG-DECIMAL IS NULL
    RETURN NULL.
  COMPUTE BIG-DECIMAL = TRUNCATE-UTIL-TRUNCATE-DECIMAL(WS-UNSCALED-WIDTH, BIG-DECIMAL).
  RETURN BIG-DECIMAL.

STOP RUN.