IDENTIFICATION DIVISION.
PROGRAM-ID. DYN-METHODS.

ENVIRONMENT DIVISION.
REPOSITORY.
    FUNCTION ALL INTRINSIC FUNCTIONS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NOOP-METHOD.
   03 WS-NOOP-INVOKE-CHECKED.
      05 PROCEDURE-POINTER TO FUNCTION RETURNING OBJECT.
   03 WS-NOOP-BIND.
      05 PROCEDURE-POINTER TO FUNCTION RETURNING OBJECT.
   03 WS-NOOP-AS-STATIC.
      05 PROCEDURE-POINTER TO FUNCTION RETURNING OBJECT.
   03 WS-NOOP-IS-STATIC
      05 FUNCTION-POINTER RETURNING BOOLEAN.
   03 WS-NOOP-TO-STRING
      05 FUNCTION-POINTER RETURNING CW(255).

01 WS-UNBOUND-METHOD.
   03 WS-METHOD USAGE POINTER.
   03 WS-NAME PIC X(255).
   03 WS-ARG-LENGTH PIC S9(9) COMP.

01 WS-BOUND-METHOD.
   03 WS-UNBOUND-METHOD USAGE POINTER.
   03 WS-RECEIVER USAGE OBJECT REFERENCE.

01 WS-STATIC-METHOD.
   03 WS-UNBOUND-METHOD USAGE POINTER.

01 WS-BUILDER.
   03 WS-NAME PIC X(255).
   03 WS-LOADER USAGE OBJECT REFERENCE.
   03 WS-METHOD USAGE POINTER.

PROCEDURE DIVISION.

    DEFINE FUNCTION WS-NOOP-INVOKE-CHECKED USING OBJECT, OBJECT-ARRAY
            RETURNING OBJECT.
        RETURN NULL.
    END-FUNCTION.

    DEFINE FUNCTION WS-NOOP-BIND USING OBJECT
            RETURNING OBJECT.
        RETURN NEW WS-BOUND-METHOD(WS-NOOP-METHOD, OBJECT).
    END-FUNCTION.

    DEFINE FUNCTION WS-NOOP-AS-STATIC
            RETURNING OBJECT.
        RETURN NEW WS-STATIC-METHOD(WS-NOOP-METHOD).
    END-FUNCTION.

    DEFINE FUNCTION WS-NOOP-IS-STATIC
            RETURNING BOOLEAN.
        RETURN TRUE.
    END-FUNCTION.

    DEFINE FUNCTION WS-NOOP-TO-STRING
            RETURNING CW(255).
        RETURN "DynMethods.UnboundMethod(NOOP)".
    END-FUNCTION.

    DEFINE FUNCTION WS-UNBOUND-METHOD-INVOKE-CHECKED USING OBJECT, OBJECT-ARRAY
            RETURNING OBJECT.
        SET WS-METHOD TO FUNCTION-POINTER OF WS-UNBOUND-METHOD.
        IF WS-ARG-LENGTH < 0 THEN
            RETURN INVOKE WS-METHOD USING OBJECT, OBJECT-ARRAY
        ELSE
            RETURN INVOKE WS-METHOD USING OBJECT, OBJECT-ARRAY(1:WS-ARG-LENGTH)
        END-IF.
    END-FUNCTION.

    DEFINE FUNCTION WS-UNBOUND-METHOD-INVOKE USING OBJECT, OBJECT-ARRAY
            RETURNING OBJECT.
        PERFORM WS-UNBOUND-METHOD-INVOKE-CHECKED USING OBJECT, OBJECT-ARRAY
        EXCEPTION WHEN OTHER
            IF EXCEPTION-OBJECT IS INSTANCE OF RUNTIME-EXCEPTION THEN
                RAISE EXCEPTION-OBJECT
            ELSE
                RAISE NEW RUNTIME-EXCEPTION(EXCEPTION-OBJECT)
            END-IF
        END-PERFORM.
    END-FUNCTION.

    DEFINE FUNCTION WS-UNBOUND-METHOD-BIND USING OBJECT
            RETURNING OBJECT.
        IF WS-METHOD-IS-STATIC THEN
            RAISE NEW ILLEGAL-STATE-EXCEPTION("Cannot bind static method %s", WS-METHOD)
        END-IF.
        IF NOT WS-METHOD-DECLARING-CLASS:IS-ASSIGNABLE-FROM(OBJECT-CLASS) THEN
            RAISE NEW ILLEGAL-ARGUMENT-EXCEPTION("Cannot bind %s to instance of %s", WS-METHOD, OBJECT-CLASS)
        END-IF.
        RETURN NEW WS-BOUND-METHOD(SELF, OBJECT).
    END-FUNCTION.

    DEFINE FUNCTION WS-UNBOUND-METHOD-IS-STATIC
            RETURNING BOOLEAN.
        RETURN (FUNCTION-POINTER OF WS-METHOD-MODIFIERS & X'0008') <> 0.
    END-FUNCTION.

    DEFINE FUNCTION WS-UNBOUND-METHOD-IS-NOOP
            RETURNING BOOLEAN.
        RETURN SELF IS WS-NOOP-METHOD.
    END-FUNCTION.

    DEFINE FUNCTION WS-UNBOUND-METHOD-AS-STATIC
            RETURNING OBJECT.
        IF NOT WS-METHOD-IS-STATIC THEN
            RAISE NEW ILLEGAL-STATE-EXCEPTION("Method is not static")
        END-IF.
        RETURN NEW WS-STATIC-METHOD(SELF).
    END-FUNCTION.

    DEFINE FUNCTION WS-UNBOUND-METHOD-TO-STRING
            RETURNING CW(255).
        RETURN "DynMethods.UnboundMethod(name=" & WS-NAME & " method=" & WS-METHOD & ")".
    END-FUNCTION.

    DEFINE FUNCTION WS-BOUND-METHOD-INVOKE-CHECKED USING OBJECT-ARRAY
            RETURNING OBJECT.
        PERFORM WS-UNBOUND-METHOD-INVOKE-CHECKED USING WS-RECEIVER, OBJECT-ARRAY.
    END-FUNCTION.

    DEFINE FUNCTION WS-BOUND-METHOD-INVOKE USING OBJECT-ARRAY
            RETURNING OBJECT.
        PERFORM WS-BOUND-METHOD-INVOKE-CHECKED USING OBJECT-ARRAY
        EXCEPTION WHEN OTHER
            IF EXCEPTION-OBJECT IS INSTANCE OF RUNTIME-EXCEPTION THEN
                RAISE EXCEPTION-OBJECT
            ELSE
                RAISE NEW RUNTIME-EXCEPTION(EXCEPTION-OBJECT)
            END-IF
        END-PERFORM.
    END-FUNCTION.

    DEFINE FUNCTION WS-STATIC-METHOD-INVOKE-CHECKED USING OBJECT-ARRAY
            RETURNING OBJECT.
        PERFORM WS-UNBOUND-METHOD-INVOKE-CHECKED USING NULL, OBJECT-ARRAY.
    END-FUNCTION.

    DEFINE FUNCTION WS-STATIC-METHOD-INVOKE USING OBJECT-ARRAY
            RETURNING OBJECT.
        PERFORM WS-STATIC-METHOD-INVOKE-CHECKED USING OBJECT-ARRAY
        EXCEPTION WHEN OTHER
            IF EXCEPTION-OBJECT IS INSTANCE OF RUNTIME-EXCEPTION THEN
                RAISE EXCEPTION-OBJECT
            ELSE
                RAISE NEW RUNTIME-EXCEPTION(EXCEPTION-OBJECT)
            END-IF
        END-PERFORM.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-IMPL USING STRING, STRING, OBJECT-ARRAY
            RETURNING OBJECT.
        IF WS-METHOD IS NOT NULL THEN
            RETURN SELF
        END-IF.
        
        PERFORM WS-BUILDER-IMPL-WITH-CLASS USING STRING, STRING, OBJECT-ARRAY.
        RETURN SELF.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-IMPL USING STRING, OBJECT-ARRAY
            RETURNING OBJECT.
        PERFORM WS-BUILDER-IMPL USING STRING, WS-NAME, OBJECT-ARRAY.
        RETURN SELF.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-IMPL USING CLASS, STRING, OBJECT-ARRAY
            RETURNING OBJECT.
        IF WS-METHOD IS NOT NULL THEN
            RETURN SELF
        END-IF.
        
        PERFORM WS-BUILDER-IMPL-WITH-CLASS USING CLASS, STRING, OBJECT-ARRAY.
        RETURN SELF.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-IMPL USING CLASS, OBJECT-ARRAY
            RETURNING OBJECT.
        PERFORM WS-BUILDER-IMPL USING CLASS, WS-NAME, OBJECT-ARRAY.
        RETURN SELF.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-HIDDEN-IMPL USING STRING, STRING, OBJECT-ARRAY
            RETURNING OBJECT.
        IF WS-METHOD IS NOT NULL THEN
            RETURN SELF
        END-IF.
        
        PERFORM WS-BUILDER-HIDDEN-IMPL-WITH-CLASS USING STRING, STRING, OBJECT-ARRAY.
        RETURN SELF.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-HIDDEN-IMPL USING STRING, OBJECT-ARRAY
            RETURNING OBJECT.
        PERFORM WS-BUILDER-HIDDEN-IMPL USING STRING, WS-NAME, OBJECT-ARRAY.
        RETURN SELF.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-HIDDEN-IMPL USING CLASS, STRING, OBJECT-ARRAY
            RETURNING OBJECT.
        IF WS-METHOD IS NOT NULL THEN
            RETURN SELF
        END-IF.
        
        PERFORM WS-BUILDER-HIDDEN-IMPL-WITH-CLASS USING CLASS, STRING, OBJECT-ARRAY.
        RETURN SELF.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-HIDDEN-IMPL USING CLASS, OBJECT-ARRAY
            RETURNING OBJECT.
        PERFORM WS-BUILDER-HIDDEN-IMPL USING CLASS, WS-NAME, OBJECT-ARRAY.
        RETURN SELF.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-IMPL-WITH-CLASS USING STRING, STRING, OBJECT-ARRAY.
        PERFORM
            INVOKE CLASS-BY-NAME(STRING, WS-LOADER) GIVING TARGET-CLASS
            TRY
                SET WS-METHOD TO NEW WS-UNBOUND-METHOD(
                        INVOKE TARGET-CLASS GET-METHOD(STRING, OBJECT-ARRAY), WS-NAME)
            CATCH CLASS-NOT-FOUND-EXCEPTION
                CONTINUE
            END-TRY
        END-PERFORM.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-HIDDEN-IMPL-WITH-CLASS USING CLASS, STRING, OBJECT-ARRAY.
        TRY
            SET WS-METHOD TO NEW WS-UNBOUND-METHOD(
                    INVOKE CLASS GET-DECLARED-METHOD(STRING, OBJECT-ARRAY), WS-NAME)
            PERFORM INVOKE FUNCTION ACCESS-CONTROLLER DO-PRIVILEGED
                    USING NEW WS-MAKE-ACCESSIBLE(WS-METHOD)
        CATCH SECURITY-EXCEPTION, NO-SUCH-METHOD-EXCEPTION
            CONTINUE
        END-TRY.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-OR-NOOP
            RETURNING OBJECT.
        IF WS-METHOD IS NULL THEN
            SET WS-METHOD TO WS-NOOP-METHOD
        END-IF.
        RETURN SELF.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-BUILD
            RETURNING OBJECT.
        IF WS-METHOD IS NOT NULL THEN
            RETURN WS-METHOD
        ELSE
            RAISE NEW RUNTIME-EXCEPTION("Cannot find method: " & WS-NAME)
        END-IF.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-BUILD-WITH-RECEIVER USING OBJECT
            RETURNING OBJECT.
        RETURN INVOKE WS-BUILDER-BUILD BIND USING OBJECT.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-BUILD-CHECKED
            RETURNING OBJECT.
        IF WS-METHOD IS NOT NULL THEN
            RETURN WS-METHOD
        ELSE
            RAISE NEW NO-SUCH-METHOD-EXCEPTION("Cannot find method: " & WS-NAME)
        END-IF.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-BUILD-CHECKED-WITH-RECEIVER USING OBJECT
            RETURNING OBJECT.
        RETURN INVOKE WS-BUILDER-BUILD-CHECKED BIND USING OBJECT.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-BUILD-STATIC-CHECKED
            RETURNING OBJECT.
        RETURN INVOKE WS-BUILDER-BUILD-CHECKED AS-STATIC.
    END-FUNCTION.

    DEFINE FUNCTION WS-BUILDER-BUILD-STATIC
            RETURNING OBJECT.
        RETURN INVOKE WS-BUILDER-BUILD AS-STATIC.
    END-FUNCTION.

    DEFINE CLASS WS-MAKE-ACCESSIBLE.
        01 WS-HIDDEN USAGE POINTER.
        
        PROCEDURE DIVISION USING WS-HIDDEN.
            INVOKE WS-HIDDEN SET-ACCESSIBLE(TRUE).
            RETURN.
        END-PROGRAM.
    END-CLASS.

    DEFINE FUNCTION BUILDER USING STRING
            RETURNING OBJECT.
        RETURN NEW WS-BUILDER(STRING, THREAD-CONTEXT-CLASSLOADER).
    END-FUNCTION.

END PROGRAM DYN-METHODS.